Revit 2027 API
FamilyStructuralMaterialTypeFilter.StructuralMaterialType Property
 The family structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralMaterialType StructuralMaterialType { get; }
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
member StructuralMaterialType : StructuralMaterialType with get
Property Value
StructuralMaterialType
See Also
Reference
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace